
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 10 to add, 2 to change, 20 to destroy.</code></pre>

* Update
  * module.alert-action-group.azurerm_resource_group_template_deployment.action-group
  * module.send-letter-key-vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * azurerm_key_vault_secret.POSTGRES-PASS
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * azurerm_key_vault_secret.staging_db_host[0]
  * azurerm_key_vault_secret.staging_db_name[0]
  * azurerm_key_vault_secret.staging_db_password[0]
  * azurerm_key_vault_secret.staging_db_port[0]
  * azurerm_key_vault_secret.staging_db_user[0]
* Replace
  * azurerm_key_vault_secret.flexible_secret[&#34;DATABASE&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;HOST&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PASS&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;PORT&#34;]
  * azurerm_key_vault_secret.flexible_secret[&#34;USER&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;host&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;name&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;password&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;port&#34;]
  * azurerm_key_vault_secret.flexible_secret_staging[&#34;user&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-PASS is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-PASS/4bae17006430490c8776524ea423586d" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-POSTGRES-PASS" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-PASS/versions/4bae17006430490c8776524ea423586d" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-PASS" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "4bae17006430490c8776524ea423586d" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-PASS" -> null
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES-USER is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-USER/5a38bee2173149f68a8c5a7e558aa51f" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-POSTGRES-USER" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-USER/versions/5a38bee2173149f68a8c5a7e558aa51f" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-USER" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "5a38bee2173149f68a8c5a7e558aa51f" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-USER" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_DATABASE is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-DATABASE/06cf6d9aca0e40c5916ba425d51430be" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-POSTGRES-DATABASE" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-DATABASE/versions/06cf6d9aca0e40c5916ba425d51430be" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-DATABASE" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "06cf6d9aca0e40c5916ba425d51430be" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-DATABASE" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_HOST is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-HOST/da25bbcbe57b45b0b63373d949586097" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-POSTGRES-HOST" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-HOST/versions/da25bbcbe57b45b0b63373d949586097" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-HOST" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "da25bbcbe57b45b0b63373d949586097" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-HOST" -> null
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be destroyed
  # (because azurerm_key_vault_secret.POSTGRES_PORT is not in configuration)
  - resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-PORT/479d53d71c0445919f724232bc308169" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-POSTGRES-PORT" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-PORT/versions/479d53d71c0445919f724232bc308169" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-PORT" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "479d53d71c0445919f724232bc308169" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-PORT" -> null
    }

  # azurerm_key_vault_secret.flexible_secret["DATABASE"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-14T11:30:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-DATABASE/2134c43c968c4684b6fb8c7f15ac74ca" -> (known after apply)
      ~ name                    = "send-letter-service-POSTGRES-FLEXIBLE-DATABASE" -> "send-letter-service-POSTGRES-DATABASE" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-DATABASE/versions/2134c43c968c4684b6fb8c7f15ac74ca" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "2134c43c968c4684b6fb8c7f15ac74ca" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-DATABASE" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["HOST"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-14T11:30:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-HOST/d836da752de14bbf83a047452a6e363d" -> (known after apply)
      ~ name                    = "send-letter-service-POSTGRES-FLEXIBLE-HOST" -> "send-letter-service-POSTGRES-HOST" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-HOST/versions/d836da752de14bbf83a047452a6e363d" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "d836da752de14bbf83a047452a6e363d" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-HOST" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PASS"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-14T11:30:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-PASS/ac2438a8f22940fc97e0a99c494e040c" -> (known after apply)
      ~ name                    = "send-letter-service-POSTGRES-FLEXIBLE-PASS" -> "send-letter-service-POSTGRES-PASS" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-PASS/versions/ac2438a8f22940fc97e0a99c494e040c" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "ac2438a8f22940fc97e0a99c494e040c" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-PASS" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["PORT"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-14T11:30:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-PORT/9e8befc498b64ebaa25fe2cf60709a32" -> (known after apply)
      ~ name                    = "send-letter-service-POSTGRES-FLEXIBLE-PORT" -> "send-letter-service-POSTGRES-PORT" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-PORT/versions/9e8befc498b64ebaa25fe2cf60709a32" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "9e8befc498b64ebaa25fe2cf60709a32" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-PORT" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret["USER"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret" {
      ~ expiration_date         = "2025-11-14T11:30:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-USER/8ffaa1861dd3473bb72494585fdc9636" -> (known after apply)
      ~ name                    = "send-letter-service-POSTGRES-FLEXIBLE-USER" -> "send-letter-service-POSTGRES-USER" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-USER/versions/8ffaa1861dd3473bb72494585fdc9636" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "8ffaa1861dd3473bb72494585fdc9636" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-POSTGRES-FLEXIBLE-USER" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["host"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-14T11:29:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-host/e14c78e24424424687dfe52f83024625" -> (known after apply)
      ~ name                    = "send-letter-service-staging-flexible-db-host" -> "send-letter-service-staging-db-host" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-host/versions/e14c78e24424424687dfe52f83024625" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-host" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "e14c78e24424424687dfe52f83024625" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-host" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["name"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-14T11:29:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-name/318b2d9efcdd494fb342244598465f04" -> (known after apply)
      ~ name                    = "send-letter-service-staging-flexible-db-name" -> "send-letter-service-staging-db-name" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-name/versions/318b2d9efcdd494fb342244598465f04" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-name" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "318b2d9efcdd494fb342244598465f04" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["password"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-14T11:29:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-password/cce23d8578734a4cb9c7efd9dc6e0a80" -> (known after apply)
      ~ name                    = "send-letter-service-staging-flexible-db-password" -> "send-letter-service-staging-db-password" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-password/versions/cce23d8578734a4cb9c7efd9dc6e0a80" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-password" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "cce23d8578734a4cb9c7efd9dc6e0a80" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["port"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-14T11:29:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-port/ddcd2a017bc64f6f9c018754bde8202a" -> (known after apply)
      ~ name                    = "send-letter-service-staging-flexible-db-port" -> "send-letter-service-staging-db-port" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-port/versions/ddcd2a017bc64f6f9c018754bde8202a" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-port" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "ddcd2a017bc64f6f9c018754bde8202a" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-port" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.flexible_secret_staging["user"] must be replaced
-/+ resource "azurerm_key_vault_secret" "flexible_secret_staging" {
      ~ expiration_date         = "2025-11-14T11:29:00Z" -> (known after apply)
      ~ id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-user/7f45e288ba82486abb70958da038f39b" -> (known after apply)
      ~ name                    = "send-letter-service-staging-flexible-db-user" -> "send-letter-service-staging-db-user" # forces replacement
      ~ resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-user/versions/7f45e288ba82486abb70958da038f39b" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-flexible-db-user" -> (known after apply)
        tags                    = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/send-letter-service.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
            "source"              = "send-letter-service PostgreSQL"
        }
      ~ version                 = "7f45e288ba82486abb70958da038f39b" -> (known after apply)
      ~ versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-flexible-db-user" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.staging_db_host[0] will be destroyed
  # (because azurerm_key_vault_secret.staging_db_host is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_host" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-host/278b197b1ed54178973f966b9989c66b" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-staging-db-host" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-host/versions/278b197b1ed54178973f966b9989c66b" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-host" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "278b197b1ed54178973f966b9989c66b" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-host" -> null
    }

  # azurerm_key_vault_secret.staging_db_name[0] will be destroyed
  # (because azurerm_key_vault_secret.staging_db_name is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_name" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-name/73f12da3bafe484dbaaf0b85cffa5886" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-staging-db-name" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-name/versions/73f12da3bafe484dbaaf0b85cffa5886" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-name" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "73f12da3bafe484dbaaf0b85cffa5886" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-name" -> null
    }

  # azurerm_key_vault_secret.staging_db_password[0] will be destroyed
  # (because azurerm_key_vault_secret.staging_db_password is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_password" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-password/ff19bae28475446e980163667dd49eb4" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-staging-db-password" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-password/versions/ff19bae28475446e980163667dd49eb4" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "ff19bae28475446e980163667dd49eb4" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-password" -> null
    }

  # azurerm_key_vault_secret.staging_db_port[0] will be destroyed
  # (because azurerm_key_vault_secret.staging_db_port is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_port" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-port/7def5ef4913c46f8a520e128ab0cca7a" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-staging-db-port" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-port/versions/7def5ef4913c46f8a520e128ab0cca7a" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-port" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "7def5ef4913c46f8a520e128ab0cca7a" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-port" -> null
    }

  # azurerm_key_vault_secret.staging_db_user[0] will be destroyed
  # (because azurerm_key_vault_secret.staging_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "staging_db_user" {
      - id                      = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-user/e22f801080964beba9d45c8af609e01d" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat" -> null
      - name                    = "send-letter-service-staging-db-user" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-user/versions/e22f801080964beba9d45c8af609e01d" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat/secrets/send-letter-service-staging-db-user" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value) -> null
      - version                 = "e22f801080964beba9d45c8af609e01d" -> null
      - versionless_id          = "https://rpe-send-letter-aat.vault.azure.net/secrets/send-letter-service-staging-db-user" -> null
    }

  # module.alert-action-group.azurerm_resource_group_template_deployment.action-group will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "action-group" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.Resources/deployments/BSP_Alert"
        name                = "BSP_Alert"
        tags                = {}
      ~ template_content    = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName      = {
                      ~ type = "String" -> "string"
                    }
                  ~ emailReceiverAddress = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ emailReceiverName    = {
                      ~ type     = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location             = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ shortName            = {
                      ~ type = "String" -> "string"
                    }
                }
                # (3 unchanged attributes hidden)
            }
        )
        # (4 unchanged attributes hidden)
    }

  # module.send-letter-key-vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-send-letter-service-aat/providers/Microsoft.KeyVault/vaults/rpe-send-letter-aat|rpe-send-letter-aat"
        name                           = "rpe-send-letter-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 10 to add, 2 to change, 20 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":2421,"Program":"tfcmt","SHA1":"","Vars":{}} -->